Autodesk.Revit.DB.BoundaryValidation.IsValidBoundaryOnSketchPlane(Autodesk.Revit.DB.SketchPlane,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Indicates if the given curve loops compose a valid boundary on the sketch plane.
Remarks:
The curve loops are valid if projections of the loops onto the sketch plane do not intersect each other;
each curve loop is closed; input curves do not contain any helical curve;
and each loop is planar and lies on a plane parallel to the sketch plane, but not necessarily the same plane.
sketchPlane:
The sketch plane.
curveLoops:
The curve loops to be checked.
Returns:
True if the given curve loops are valid as described above, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.BoundaryValidation.IsValidBoundaryOnView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Indicates if the given curve loops compose a valid boundary on the view's detail sketch plane.
Remarks:
The curve loops are valid if projections of the loops onto the views's detail sketch plane do not intersect each other;
each curve loop is closed; input curves do not contain any helical curve;
and each loop is planar and lies on a plane parallel to the views's detail sketch plane, but not necessarily the same plane.
document:
The document.
viewId:
The view Id.
curveLoops:
The curve loops to be checked.
Returns:
True if the given curve loops are valid as described above, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.BoundaryValidation.IsValidHorizontalBoundary(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Identifies whether the given curve loops compose a valid horizontal boundary.
Remarks:
The curve loops are valid if projections of the loops onto a horizontal(XY) plane do not intersect each other;
each curve loop is closed; input curves do not contain any helical curve;
and each loop is planar and lies on a plane parallel to the horizontal(XY) plane, but not necessarily the same plane.
curveLoops:
The curve loops to be checked.
Returns:
True if the given curve loops are valid as described above, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.BoundaryValidation.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BoundaryValidation
Curve loop validators.
Since:
2022